МП/src/InformationRegisters/Напоминания/Напоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Напоминания</name>
  <resources>
    <name>ДатаНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяНапоминания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзначальнаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ЭлементыДоски</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МП/src/InformationRegisters/Напоминания/Forms/ФормаНапоминаний/Module.bsl
&НаКлиенте
Процедура ЗакрытьФорму(Команда)//Ден  2016 10 11 ---
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокНапоминанийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)//Ден  2016 10 11 ---
	ТекущиеДанные = Элемент.ТекущиеДанные;	
	Структура = Новый Структура("Ключ", ПолучитьКлюч(ТекущиеДанные.Элемент, ТекущиеДанные.Комментарий));
	ОткрытьФорму("РегистрСведений.Напоминания.Форма.ФормаЗаписи", Структура);

	ИндексТекущейСтроки = СписокНапоминаний.Индекс(ТекущиеДанные);
	СписокНапоминаний.Удалить(ИндексТекущейСтроки);
	Если СписокНапоминаний.Количество() = 0 Тогда
		закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Функция ПолучитьКлюч(Элемент, Комментарий)//Ден  2016 10 27 ---
	Возврат РегистрыСведений.Напоминания.СоздатьКлючЗаписи(Новый Структура("Элемент, Комментарий", Элемент, Комментарий));
КонецФункции

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)//Ден  2016 10 14
//	ЗаполнитьСписокНапоминаний();	
//КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНапоминаний()//Ден  2016 10 14
	
	СписокНапоминаний.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Напоминания.ДатаНапоминания КАК ДатаНапоминания,
	|	Напоминания.Элемент КАК Элемент,
	|	Напоминания.Комментарий КАК Комментарий,
	|	Напоминания.ВремяНапоминания КАК ВремяНапоминания,
	|	Напоминания.Периодичность КАК Периодичность
	|ИЗ
	|	РегистрСведений.Напоминания КАК Напоминания
	|ГДЕ
	|	Напоминания.ДатаНапоминания <= &ДатаНапоминания";	
	Запрос.УстановитьПараметр("ДатаНапоминания", ТекущаяДата());	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Нстр = СписокНапоминаний.добавить();
		Нстр.Напоминание = строка(Выборка.ДатаНапоминания) + " " + Выборка.Элемент + " " + Выборка.Комментарий; 
		ЗаполнитьЗначенияСвойств(Нстр,Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)//Ден  2016 10 14
	ЗаполнитьСписокНапоминаний();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)//Ден  2016 10 14
	Если ИмяСобытия = "ПерезаписьНапоминаний" Тогда
		ЗаполнитьСписокНапоминаний();
		Если СписокНапоминаний.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокНапоминаний();	
КонецПроцедуры
